dict1 = {1: [['A', 'E', 'I', 'O', 'U', 'L', 'N', 'S', 'T', 'R'],['А', 'В', 'Е', 'И', 'Н', 'О', 'Р', 'С', 'Т']], 
        2: [['D', 'G'],['Д', 'К', 'Л', 'М', 'П', 'У']],
        3: [['B', 'C', 'M', 'P'],['Б', 'Г', 'Ё', 'Ь', 'Я']],
        4: [['F', 'H', 'V', 'W', 'Y'],['Й', 'Ы']],
        5: [['K'],['Ж', 'З', 'Х', 'Ц', 'Ч']],
        8: [['J', 'X'],['Ш', 'Э', 'Ю']],
        10: [['Q','Z'],['Ф', 'Щ', 'Ъ']]}

word = str(input("Введите слово: ").upper())
acc = 0
for i in word:
    for (key, value) in dict1.items():
        for j in range(len(value)):
            for l in range(len(value[j])):
                if i == value[j][l]:
                    acc = acc + key

print ("Стоимость введенного слова: " + str(acc))